courses/app/controllers/coursefeedbacks_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    course= Course.find(params[:course_id])