courses/app/controllers/coursephotos_controller.rb

  def new
    course= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."course_id" = ? LIMIT 1  [[nil, 78]]

  def create
    @coursephoto = Coursephoto.new(coursephoto_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @coursephoto.save
        course.coursephoto=@coursephoto.id
        course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "coursephotos" ("photourl", "created_at", "updated_at") VALUES (?, ?, ?)  [["photourl", "asdas"], ["created_at", "2015-05-23 12:30:55.865569"], ["updated_at", "2015-05-23 12:30:55.865569"]]
UPDATE "courses" SET "coursephoto" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["coursephoto", "2"], ["updated_at", "2015-05-23 12:39:12.534478"], ["id", 14]]

  def set_course
    @course = Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 78]]