courses/app/controllers/coursebasics_controller.rb

  def update
    @course.update(course_params)
---
UPDATE "courses" SET "title" = ?, "subtitle" = ?, "language_id" = ?, "level_id" = ?, "certificate" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "asdas"], ["subtitle", "asdad"], ["language_id", 1], ["level_id", 1], ["certificate", "t"], ["updated_at", "2015-05-16 14:12:45.941672"], ["id", 78]]