courses/app/controllers/courseprivacies_controller.rb

  def new
    course= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @courseprivacy = Courseprivacy.new(courseprivacy_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @courseprivacy.save
        if course.privacy_level==nil
          course.privacy_level=""
        end
        course.privacy_level=@courseprivacy.id
        course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "courseprivacies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-23 14:48:17.282541"], ["updated_at", "2015-05-23 14:48:17.282541"]]
UPDATE "courses" SET "privacy_level" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["privacy_level", 1], ["updated_at", "2015-05-23 14:48:17.500476"], ["id", 1]]