courses/app/controllers/learningobjectives_controller.rb

INSERT INTO "courses" ("objectives", "created_at", "updated_at") VALUES (?, ?, ?)  [["objectives", "gfdgf"], ["created_at", "2015-04-26 10:24:05.292365"], ["updated_at", "2015-04-26 10:24:05.292365"]]
---
  def create
    @course = Course.new(course_params)
    respond_to do |format|

      if @course.save