courses/app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def new
    course= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @lesson = Lesson.new(lesson_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @lesson.save
        if course.lectures==nil
          course.lectures=""
        end
        course.lectures=course.lectures+","+@lesson.id.to_s
        course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "lessons" ("title", "description", "level_id", "contenturl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "TEst"], ["description", "Test"], ["level_id", 1], ["contenturl", "lolzzz"], ["created_at", "2015-05-16 17:19:51.108104"], ["updated_at", "2015-05-16 17:19:51.108104"]]
UPDATE "courses" SET "lectures" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["lectures", ",21"], ["updated_at", "2015-05-23 12:42:26.121078"], ["id", 18]]

    def set_lesson
      @lesson = Lesson.find(params[:lessonid])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", 7]]

  def set_course
    @course=Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 8]]