courses/app/controllers/manageinstructors_controller.rb

  def new
    course= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @manageinstructor = Manageinstructor.new(priceandcoupon_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @manageinstructor.save
        if course.instructoridlist ==nil
          course.instructoridlist=""
        end
        course.instructoridlist=course.instructoridlist+","+@manageinstructor.id.to_s
        course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "manageinstructors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-23 15:56:44.514271"], ["updated_at", "2015-05-23 15:56:44.514271"]]
UPDATE "courses" SET "instructoridlist" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["instructoridlist", ",2"], ["updated_at", "2015-05-23 15:56:57.890015"], ["id", 1]]