courses/app/controllers/priceandcoupons_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    course= Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "priceandcoupons" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-23 15:44:34.517999"], ["updated_at", "2015-05-23 15:44:34.517999"]]
UPDATE "courses" SET "priceandcoupon_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["priceandcoupon_id", 2], ["updated_at", "2015-05-23 15:45:29.216611"], ["id", 2]]
---
  def create
    @priceandcoupon = Priceandcoupon.new(priceandcoupon_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @priceandcoupon.save
        if course.priceandcoupon_id ==nil
          course.priceandcoupon_id=""
        end
        course.priceandcoupon_id=@priceandcoupon.id.to_s
        course.save