courses/app/controllers/questions_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 13]]
---
  def new
    course= Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "questions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-05-23 14:01:56.075346"], ["updated_at", "2015-05-23 14:01:56.075346"]]
UPDATE "courses" SET "questionslist" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["questionslist", ",1"], ["updated_at", "2015-05-23 14:07:46.066320"], ["id", 1]]
---
  def create
    @question = Question.new(question_params)
    course= Course.find(params[:course_id])

    respond_to do |format|
      if @question.save
        if course.questionslist ==nil
          course.questionslist=""
        end
        course.questionslist=course.questionslist+","+@question.id.to_s
        course.save